//STEP1   EXEC PGM=IKJEFT01,PARM='POCREXXC'
//*STEP1   EXEC PGM=IKJEFT01,PARM='POCREXXS'
//* THIS SHOULD POINT TO YOUR DB2 SDSNLOAD IF YOU INCLUDE DB2 CODE
//STEPLIB   DD DSN=DSN910.SDSNLOAD,DISP=SHR
//          DD DSN=FAN140.SEAGLPA,DISP=SHR
//SYSEXEC   DD DSN=&SYSUID..POCLIB,DISP=SHR
//SYSTSPRT  DD SYSOUT=*
//SYSTSIN   DD DUMMY
